tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
cask_args appdir: '/Applications'
brew 'mas' # Mac App Store CLI

# DEV
cask 'visual-studio-code' # code editor
cask 'zed' # code editor
cask 'iterm2' # terminal
brew 'spaceship' # zsh theme
brew 'git' # version control
brew 'elixir' # programing language
brew 'node' # programing language
brew 'openssl' # SSL/TLS cryptography library
brew 'postgresql@16' # database
brew 'orbstack' # docker replacement
tap 'oven-sh/bun' 
brew 'bun' # JS bundler

# UTILITY

cask 'arc' # browser
cask 'brave-browser@dev' # browser
cask 'google-chrome' # browser
cask 'raycast' # launcher
cask '1password' # password manager
cask 'backblaze' # backup
cask 'ivpn' # VPN
cask 'maccy' # clipboard manager
mas 'Sip', id: 507257563 # capture colors on screen
mas 'BetterSnapTool', id: 417375580 # window manager
mas 'The Unarchiver', id: 425424353 # archive manager
mas 'Unclutter', id: 577085396 # organizer

# Play

cask 'spotify' # music
cask 'iina' # video player
mas 'Affinity Photo 2', id: 1616822987
mas 'Affinity Designer 2', id: 1616831348
mas 'Affinity Publisher 2', id: 1606941598

# QuickLook

cask 'qlimagesize' # QuickLook image info
cask 'qlstephen' # QuickLook plain text no extension
cask 'qlvideo' # QuickLook video
