tap 'homebrew/bundle'
tap 'homebrew/cask-versions'


brew 'elixir'
brew 'mas'
brew 'node'
brew 'openssl'
brew 'redis'
brew 'postgresql@10'
brew 'yarn'
brew 'youtube-dl'

cask_args appdir: '/Applications'

# Quality of Life

cask '1password'
cask 'alfred'
cask 'flux'

mas 'BetterSnapTool', id: 417375580
mas 'EasyOnTheEyes', id: 799584781 # super dim screen
mas 'Negative', id: 1378123825 # invert PDFs
mas 'The Unarchiver', id: 425424353 # zip,rar,...
mas 'Unclutter', id: 577085396


# Work

cask 'brave-browser-dev'
cask 'google-chrome'
cask 'iterm2'
cask 'ivpn'
cask 'slack'
mas 'Harvest', id: 506189836 # trabian time tracking
mas 'Sip', id: 507257563 # capture colors on screen
cask 'suspicious-package' # inspect packagers before installing
cask 'zoomus' # video conferencing

# Play

mas 'Chaotica Studio', id: 652092136 # fractal generator
# cask 'steam' # 32bit still work?
cask 'transmission'
cask 'vlc'

# QuickLook

cask 'qlimagesize' # QuickLook image info
cask 'qlstephen' # QuickLook plain text no extension
cask 'qlvideo' # QuickLook video

# TODO
# affinity photo
# affinity designer
# affinity publisher
# backblaze
# zeronet
# signal

# DMGS

# Things

# TO DETERMINE

# mas 'EasyRes', id: 688211836
# mas 'Sleepytime', id: 40430258
# cask 'firefox'

# 32 bit
# CronniX
# Steam